In [1]:
import pandas as pd
import numpy as np

In [3]:
data_input = pd.read_excel('E:\\Graduate_Project\\IEEE ISI World Cup 2019\\competition1\\test\\纳税A级年份.xlsx')
print(data_input.head())

   企业编号  纳税A级年份
0  4001    2015
1  4001    2014
2  4001    2016
3  4001    2016
4  4002    2015

In [4]:
data = pd.get_dummies(data_input['纳税A级年份'])
data.head()

   2014  2015  2016  2017
0     0     1     0     0
1     1     0     0     0
2     0     0     1     0
3     0     0     1     0
4     0     1     0     0

In [8]:
data_input = pd.concat([data_input, data], axis=1)
data_input.head()

   企业编号  纳税A级年份  2014  2015  2016  2017
0  4001    2015     0     1     0     0
1  4001    2014     1     0     0     0
2  4001    2016     0     0     1     0
3  4001    2016     0     0     1     0
4  4002    2015     0     1     0     0

In [9]:
data_input = data_input.drop('纳税A级年份', axis=1)
data_input = data_input.groupby('企业编号').sum()
data_input = data_input.reset_index()
data_input.head()

   企业编号  2014  2015  2016  2017
0  4001     1     1     2     0
1  4002     1     1     1     1
2  4003     2     2     2     0
3  4005     1     1     0     1
4  4006     0     0     0     1

In [10]:
data_out = pd.read_excel('E:\\Graduate_Project\\IEEE ISI World Cup 2019\\competition1\\赛题1结果_团队名.xlsx')
data_out.head()

   企业编号
0  4001
1  4002
2  4003
3  4004
4  4005

In [11]:
data_out = pd.merge(data_out, data_input, how='left')
data_out.head()

   企业编号  2014  2015  2016  2017
0  4001   1.0   1.0   2.0   0.0
1  4002   1.0   1.0   1.0   1.0
2  4003   2.0   2.0   2.0   0.0
3  4004   NaN   NaN   NaN   NaN
4  4005   1.0   1.0   0.0   1.0

In [12]:
data_out.isna().sum()

企业编号     0
2014    32
2015    32
2016    32
2017    32
dtype: int64

In [13]:
data_out.fillna(0, inplace=True)
data_out.isna().sum()

企业编号    0
2014    0
2015    0
2016    0
2017    0
dtype: int64

In [14]:
data_out.head()

   企业编号  2014  2015  2016  2017
0  4001   1.0   1.0   2.0   0.0
1  4002   1.0   1.0   1.0   1.0
2  4003   2.0   2.0   2.0   0.0
3  4004   0.0   0.0   0.0   0.0
4  4005   1.0   1.0   0.0   1.0

In [15]:
data_out.to_excel('纳税A级年份_特征.xlsx', index=False)